c5/src/Documents/LoadPayments/LoadPayments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LoadPayments</name>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Application</name>
    <type>
      <types>EnumRef.Banks</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>InternalMovement</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OtherExpense</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>OtherReceipt</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Details</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OrderDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OrderNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Payer</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>105</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PayerAccount</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PayerBank</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PayerBankCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PayerFiscalCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PayerIBAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PayerSubaccount</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>29</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentContent</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>210</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Receiver</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>105</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ReceiverAccount</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ReceiverBank</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ReceiverBankCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ReceiverFiscalCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ReceiverIBAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ReceiverSubaccount</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>29</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TransactionCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TransferType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Expenses</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>AdvanceAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>BankOperation</name>
      <type>
        <types>EnumRef.BankOperations</types>
      </type>
    </attributes>
    <attributes>
      <name>CashFlow</name>
      <type>
        <types>CatalogRef.CashFlows</types>
      </type>
    </attributes>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.Contracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DetailsLine</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.VendorPayment</types>
        <types>DocumentRef.Entry</types>
      </type>
    </attributes>
    <attributes>
      <name>Download</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Operation</name>
      <type>
        <types>CatalogRef.Operations</types>
      </type>
    </attributes>
    <attributes>
      <name>Receiver</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Receipts</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>AdvanceAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>BankOperation</name>
      <type>
        <types>EnumRef.BankOperations</types>
      </type>
    </attributes>
    <attributes>
      <name>CashFlow</name>
      <type>
        <types>CatalogRef.CashFlows</types>
      </type>
    </attributes>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.Contracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DetailsLine</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Payment</types>
        <types>DocumentRef.Entry</types>
      </type>
    </attributes>
    <attributes>
      <name>Download</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Operation</name>
      <type>
        <types>CatalogRef.Operations</types>
      </type>
    </attributes>
    <attributes>
      <name>Payer</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/BankOperations/BankOperations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BankOperations</name>
  <enumValues>
    <name>InternalMovement</name>
  </enumValues>
  <enumValues>
    <name>OtherExpense</name>
  </enumValues>
  <enumValues>
    <name>OtherReceipt</name>
  </enumValues>
  <enumValues>
    <name>Payment</name>
  </enumValues>
  <enumValues>
    <name>ReturnFromVendor</name>
  </enumValues>
  <enumValues>
    <name>ReturnToCustomer</name>
  </enumValues>
  <enumValues>
    <name>VendorPayment</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/LoadPayments/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( Status = 1 ) then
		if ( not checkTables () ) then
			Cancel = true;
		endif;
	else
		Output.LoadPaymentsFirst ( , "Path" );
		Cancel = true;
	endif;
	
EndProcedure

Function checkTables ()
	
	error = false;
	paymentsExist = false;
	tables = new Array ();
	tables.Add ( Receipts );
	tables.Add ( Expenses );
	for each table in tables do
		for each row in table do
			if ( not row.Download ) then
				continue;
			endif;
			problems = new Array ();
			if ( row.Amount = 0) then
				problems.Add ( "Amount" );
			endif;
			if ( row.BankOperation.IsEmpty () ) then
				problems.Add ( "BankOperation" );
			endif;
			operation = row.BankOperation;
			if ( operation = Enums.BankOperations.Payment
				or operation = Enums.BankOperations.ReturnFromVendor
				or operation = Enums.BankOperations.VendorPayment
				or operation = Enums.BankOperations.ReturnToCustomer ) then
				if ( table = Receipts and row.Payer.IsEmpty () ) then
					problems.Add ( "Payer" );
				elsif ( table = Expenses and row.Receiver.IsEmpty () ) then
					problems.Add ( "Payer" );
				endif;
				if ( row.Contract.IsEmpty () ) then
					problems.Add ( "Contract" );
				endif;
				if ( row.AdvanceAccount.IsEmpty () ) then
					problems.Add ( "AdvanceAccount" );
				endif;
			endif;
			if ( row.Account.IsEmpty () ) then
				problems.Add ( "Account" );
			endif;
			if ( problems.Count () > 0 ) then
				error = true;
				tableName = ? ( table = Receipts, "Receipts", "Expenses" );
				line = row.LineNumber;
				for each problem in problems do
					Output.FieldIsEmpty ( , Output.Row ( tableName, line, problem ), Ref );
				enddo;
			endif;
			paymentsExist = true;
		enddo;
	enddo;
	if ( not paymentsExist ) then
		Output.PaymentsNotSelected ( , "Details" );
		error = true;
	endif;
	return not error;
	
EndFunction

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )

	if ( DataExchange.Load ) then
		return;
	endif;
	if ( IsNew () ) then
		return;
	endif;
	if ( DeletionMark ) then
		setDeletion ( true );
	elsif ( DF.Pick ( Ref, "DeletionMark" ) ) then
		setDeletion ( false );
	endif;

EndProcedure

Procedure setDeletion ( Mark )
	
	for each document in findMarked ( not Mark ) do
		document.GetObject ().SetDeletionMark ( mark );
	enddo;
	
EndProcedure

Function findMarked ( Mark )
	
	s = "
	|select Receipts.Document as Document
	|from Document.LoadPayments.Receipts as Receipts
	|where Receipts.Ref = &Ref
	|and Receipts.Document.DeletionMark = &Mark
	|union all
	|select Expenses.Document
	|from Document.LoadPayments.Expenses as Expenses
	|where Expenses.Ref = &Ref
	|and Expenses.Document.DeletionMark = &Mark";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	q.SetParameter ( "Mark", Mark );
	return q.Execute ().Unload ().UnloadColumn ( "Document" );
	
EndFunction

Procedure UndoPosting ( Cancel )
	
	unpost ();
	
EndProcedure

Procedure unpost ()
	
	for each document in findPosted () do
		document.GetObject ().Write ( DocumentWriteMode.UndoPosting );
	enddo;
	
EndProcedure

Function findPosted ()
	
	s = "
	|select Receipts.Document as Document
	|from Document.LoadPayments.Receipts as Receipts
	|where Receipts.Ref = &Ref
	|and Receipts.Document.Posted
	|union all
	|select Expenses.Document
	|from Document.LoadPayments.Expenses as Expenses
	|where Expenses.Ref = &Ref
	|and Expenses.Document.Posted";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	return q.Execute ().Unload ().UnloadColumn ( "Document" );
	
EndFunction

#endif
